# 5.4. Roman number to decimal
# В римской системе счисления для обозначения чисел используются следующие символы
# (справа записаны числа, которым они соответствуют в десятичной системе счисления):
# I = 1
# V = 5
# X = 10
# L = 50
# C = 100
# D = 500
# M = 1000
# Будем использовать вариант, в котором числа 4, 9, 40, 90, 400 и 900 записываются как вычитание
# из большего числа меньшего: IV, IX, XL, XC, CD и CM, соответственно.
# Напишите программу, которая переводит число из римской в десятичную систему счисления.
# Формат ввода:
# Строка, содержащая число, закодированное в римской системе счисления. Гарантируется, что число
# меньше 4000.
# Формат вывода:
# Строка, содержащая число в десятичной системе счисления, соответствующее введённому.
digits = {
    'IV': 4, "IX": 9, "XL": 40, "XC": 90, "CD": 400, "CM": 900,
    "M": 1000, "D": 500, "C": 100, "L": 50, "X": 10, "V": 5, "I": 1
    }
roman_number = input()
result = 0
for digit in digits:
    while digit in roman_number:
        result += digits[digit]
        roman_number = roman_number.replace(digit, "", 1)
print(result)
